kaifanzheng/STM32EncryptedCommunication/ProjectFile(EncryptedCommunication)/Src/main.c
	}
}
void getMessagePage(){
	uint8_t getBuffer[15];
	uint8_t getBufferPrev[15];
	printToScreen("get Message");
	uint8_t quit = 1;
	while(quit){
		HAL_Delay(5);
		//TODO
		hardcopy_char(getBuffer,15,getBufferPrev);
		clearBufferString(getBuffer,15);
		while(getBuffer[0] == 0){
			HAL_UART_Init(&huart4);
			HAL_UART_Receive(&huart4,getBuffer, 15, 5000);
			HAL_Delay(10);
		}
		if(strcmp((char *)getBuffer,(char *)getBufferPrev)!=0){
			clearScreen();
			printToScreen("get Message");
			printToScreen(" ");
			printToScreen((char *)getBuffer);
			printToScreen("press 1 quit");
			printToScreen("press 3 keep");
		}
		while(1){
			if(getOneCharFromKeypad() == '3'){
				clearScreen();
				printToScreen("get Message");
				printToScreen(" ");
				//printToScreen((char *)getBuffer);
				break;
			}else if(getOneCharFromKeypad() == '1'){
				quit = 0;
				break;
			}
			HAL_Delay(50);
		}
	}
}
void testSpeakerPage(){
	printToScreen("testing speaker");
	printToScreen(" ");
	printToScreen("press A exit");
	while(1){
		if(getOneCharFromKeypad() == 'A'){
			ExitToMain();
			break;
		}
		play_ringtone();
		HAL_Delay(100);
	}
}
void getTemperaturePage(){
	float tem =0;
	float hum =0;
	float temp = 0;
	float hump = 0;
	while(1){
		if(getOneCharFromKeypad() == 'A'){
			ExitToMain();
			break;
		}
		HAL_Delay(100);
		temp = tem;
		hump = hum;
		tem = read_temperature();
		hum = read_humidity();
		if(temp != tem || hump != hum){
			clearScreen();
			char temBuf[15];
			char humBuf[15];
			gcvt(tem, 8, temBuf);
			gcvt(hum, 8, humBuf);
			printToScreen("t and h are:");
			printToScreen("");
			printToScreen(temBuf);
			printToScreen( humBuf);

		}
	}
}

void enterPageMainPage(){
	  clearScreen();
	  if(mainMenuPage == 0){
		  wifiOptionPage();
	  }else if(mainMenuPage == 1){
		  sendMessagePage();
	  }else if(mainMenuPage == 2){
		  getMessagePage();
	  }else if(mainMenuPage == 3){
		  testSpeakerPage();
	  }else if(mainMenuPage == 4){
		  getTemperaturePage();
	  }
}

void UILogic(){
	char keypadInputMain = getOneCharFromKeypad();
	if(keypadInputMain == '1'){
		if(mainMenuPage>0){
			mainMenuPage -= 1;
			changePageMainPage();
		}
	}else if(keypadInputMain == '3'){
		if(mainMenuPage<4){
			mainMenuPage += 1;
			changePageMainPage();
		}
	}else if(keypadInputMain == 'A'){
		HAL_Delay(100);
		enterPageMainPage();
	}
}

//test for data transfer----
void testSend(){
	//HAL_UART_Init(&huart4);
	uint8_t buf[5];
	uint8_t counter = 0;
	while(1){
		clearBufferString(buf,5);
		if(counter % 2 == 0){
			sprintf(buf, "hello");
			HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
			printToScreen("sent hello");
		}else{
			sprintf(buf, "happy");
			HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
			printToScreen("sent happy");
		}
//		sprintf(buf, "hello");
//		HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
		counter = (counter+1)%4;
		HAL_Delay(2000);
	}
}


void testGet(){
	//HAL_UART_Init(&huart4);
	uint8_t buf[5];
	while(1){
//		printToScreen("start to get:");
//		printToScreen("");
		clearBufferString(buf,5);
		HAL_UART_Receive(&huart4, (uint8_t*) buf, (uint16_t) 5, 10000);
		printToScreen((char *) buf);
		HAL_Delay(1000);
	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_DAC1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_OCTOSPI1_Init();
  MX_I2C1_Init();
  MX_SPI3_Init();
  MX_UART4_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */

  // Testssd1306Driver();
  // generate_ringtone(ringtone_note_1, ringtone_note_2, ringtone_note_3, ringtone_note_4);
  generate_ringtone(ringtone, 1);
  HAL_TIM_Base_Start_IT(&htim2);
  BSP_HSENSOR_Init();
  BSP_TSENSOR_Init();
  HAL_UART_Init(&huart4);
  // play_ringtone();
  play_ringtone();
  //initeScreen and UI
  InitScreen();
  displayMainPageOne();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  float t;
  float h;
  while (1)
  {
	  t = read_temperature();
	  h = read_humidity();
	  //testKeypadDriver();
	  //testOLEDScreenDriverPrint();
	  //testCryotoSystem();
	  //testSend();
	  //testGet();
	  //take keypad input to flip page

	  UILogic();

	  HAL_Delay(100);

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

